Revit 2027 API
BuiltInFailures.OverlapFailures.WallRoomSeparationOverlap Property
 A wall and a room separation line overlap. One of them may be ignored when Revit finds room boundaries. Shorten or delete the room separation line to remove the overlap.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WallRoomSeparationOverlap { get; }
Public Shared ReadOnly Property WallRoomSeparationOverlap As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WallRoomSeparationOverlap {
	FailureDefinitionId^ get ();
}
static member WallRoomSeparationOverlap : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.OverlapFailures Class
Autodesk.Revit.DB Namespace